Forgot to save the files before pushing, updated. Also fixed a newline error in the Q35 .fdf file.
